<?php 
/*
 *	Made by The_stas
 *  https://github.com/NamelessMC/Nameless/
 *  NamelessMC version 2.0.0-pr5
 *
 *  License: MIT
 *
 *  Russian Language - General
 */

$language = array(
	/*
	 *  Общие условия
	 */ 
	'submit' => 'Отправить',
	'register' => 'Регистрация',
	'sign_in' => 'Войти',
	'log_out' => 'Выйти',
	'profile' => 'Профиль',
	'invalid_token' => 'Неверный токен, пожалуйста, попробуйте еще раз.',
	'close' => 'Закрыть',
	'back' => 'Вернуться',
	'warning' => 'Внимание',
	'date' => 'Дата',
	'search' => 'Поиск',
	'edit' => 'Редактировать',
	'next' => 'Следующая',
	'previous' => 'Предыдущая',
	'confirm_cancel' => 'Вы уверены, что хотите отменить?',
	'confirm_delete' => 'Подтвердить удаление',
	'confirm_deletion' => 'Вы уверены, что хотите удалить это?',
	'cancel' => 'Отмена',
	'delete' => 'Удалить',
	'none' => 'None',
	'view' => 'Обзор',
	'change' => 'Изменить',
	'remove' => 'Удалить',
	'info' => 'Информация',
	'confirm' => 'Подтвердить',
	'actions' => 'Действия',
	'alerts' => 'Оповещения',
	'view_alerts' => 'Просмотр оповещений',
	'no_alerts' => 'Нет оповещений',
	'x_new_alerts' => 'У вас {x} новых оповещений.', // Не заменять {x}
	'messages' => 'Сообщения',
	'view_messages' => 'Просмотр сообщений',
	'no_messages' => 'Нет сообщений',
	'x_new_messages' => 'У вас {x} новых сообщений.', // Не заменять {x}
	'loading' => 'Загрузка...',
	'report' => 'Отчет',
	'page_loaded_in' => 'Страница загрузилась за {x} сек.', // Не заменять {x}, единица времени - секунды
	'page_x' => 'Страница {x}',
	'browse' => 'Просмотр',
	'bypass' => 'Обход',
	'yes' => 'Да',
	'no' => 'Нет',
	'content' => 'Содержание',
	'full_content' => 'Полное Содержание',
	'url' => 'URL',
	'success' => 'Успех',
	'error' => 'Ошибка',
	'are_you_sure' => 'Уверены ли вы?',

	/*
	 *  Форма обратной связи
	 */
    'contact' => 'Связь с администрацией',
    'message' => 'Сообщение',
    'email_address' => 'Email адрес',
	'contact_email_subject' => 'Отправка новой контактной формы',
	'contact_message_failed' => 'Невозможно отправить сообщение. Убедитесь, что вы ввели сообщение длиной от 10 до 5000 символов.',
	'contact_message_sent' => 'Сообщение успешно отправлено.',
    'contact_message_email' => 'Указанный адрес электронной почты недействителен.',
	'contact_message_limit' => 'Вы можете отправить только одно сообщение в час. Затем вы можете отправить сообщение в {x} минут.', // Не заменять {x}
	
	/* 
	 *  Панель навигации
	 */
	'home' => 'Главная',
	'more' => 'Больше',
	'status' => 'Статус',
	
	/*
	 *  Домашняя страница
	 */
	'social' => 'Соц.сети',
	
	/*
	 *  Диалоги помощи
	 */
	'markdown_help' => 'Вы можете отформатировать свой пост, используя Markdown. Для получения дополнительной информации см. <a href=\'https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet\' target=\'_blank\'></a>.',

    /*
     *  Запрос к серверу
     */
    'online' => 'В сети',
    'offline' => 'Не в сети',
    'player_count' => '{x}/{y}', // Не заменять {x} или {y}
    'ping' => 'Пинг: {x}', // Не заменять {x}
    'version' => 'Версия: {x}', // Не заменять {x}
    'currently_1_player_online' => 'Сейчас 1 игрок онлайн',
    'currently_x_players_online' => 'Сейчас <strong>{x}</strong> игрок(ов) онлайн.', // Не заменять {x}
    'server_offline' => 'Сервер в данный момент отключен.',
    'connect_with_ip_x' => 'IP сервера {x}', // Не заменять {x}
    'click_to_copy_tooltip' => 'Нажмите, чтобы скопировать',
    'copied' => 'Скопирован!',
    'no_servers' => 'Нет серверов для отображения!',
    'bungee_instance' => 'Этот сервер Bungee.',
    'no_players_online' => 'Нет игроков онлайн.',
    'and_x_more' => 'и еще {x} игрок(ов)', // Не заменять {x}

    /*
     *  Уведомление о cookie
     */
    'cookie_notice' => 'Этот веб-сайт использует куки для улучшения вашего просмотра. Регистрируйтесь на нашем сайте или закройте это уведомление, так вы соглашаетесь с их использованием.',
    'cookie_agree' => 'Согласен',

    /*
     *  Виджеты
     */
    'online_staff' => 'Персонал в сети',
    'no_online_staff' => 'Нет сотрудников онлайн.',
    'online_users' => 'Пользователи онлайн',
    'no_online_users' => 'Нет пользователей онлайн.',
    'discord_widget_disabled' => 'Виджет отключен для указанного сервера Discord. Перейдите на вкладку «Виджет» в настройках сервера Discord и убедитесь, что виджет Discord включен и правильный идентификатор.',

    /*
     *  Политика конфиденциальности
     */
    'privacy_policy' => 'Политика конфиденциальности'
);