<?php 
/*
 *	Made by The_stas (stashenko)
 *  https://github.com/stashenko/NamelessMC-v2.0.0-pr5
 *  NamelessMC version 2.0.0-pr5
 *
 *  License: MIT
 *
 *  Russian Language - Users
 */

$language = array(
	/*
	 *  Измените это для сообщения проверки учетной записи
	 */
	'validate_account_command' => 'Чтобы завершить регистрацию, выполните команду в игре <strong>/validate {x}</strong>.', // Не заменять {x}

	/*
	 *  Связанные с пользователем
	 */
	'guest' => 'Гость',
	'guests' => 'Гости',
	
	// Панель пользователя
	'user_cp' => 'Панель пользователя',
	'user_cp_icon' => '<i class="fa fa-cogs" aria-hidden="true"></i> <span class="mobile_only">Панель пользователя</span>',
	'overview' => 'Обзор',
	'user_details' => 'Данные пользователя',
	'profile_settings' => 'Настройки профиля',
	'successfully_logged_out' => 'Вы успешно вышли из системы.',
	'messaging' => 'Обмен сообщениями',
	'click_here_to_view' => 'Нажмите здесь, чтобы посмотреть.',
	'moderation' => 'Модератор',
	'administration' => 'Администратор',
	'alerts' => 'Оповещения',
	'delete_all' => 'Удалить все',
	'private_profile' => 'Частный профиль',
	
	// Настройки профиля
	'field_is_required' => '{x} необходимо.', // Не заменять {x}
	'settings_updated_successfully' => 'Настройки успешно обновлены.',
	'password_changed_successfully' => 'Пароль успешно изменен.',
	'change_password' => 'Изменить пароль',
	'current_password' => 'Текущий пароль',
	'new_password' => 'Новый пароль',
	'confirm_new_password' => 'Подтвердите новый пароль',
	'incorrect_password' => 'Ваш пароль неверный.',
	'two_factor_auth' => 'Двухфакторная аутентификация',
	'enabled' => 'Включено',
	'disabled' => 'Выключено',
	'enable' => 'Включить',
	'disable' => 'Выключить',
	'tfa_scan_code' => 'Пожалуйста, отсканируйте следующий код в приложении аутентификации:',
	'tfa_code' => 'Если на вашем устройстве нет камеры или вы не можете отсканировать QR-код, введите следующий код:',
	'tfa_enter_code' => 'Пожалуйста, введите код, отображаемый в вашем приложении для аутентификации:',
	'invalid_tfa' => 'Неверный код, пожалуйста, попробуйте еще раз.',
	'tfa_successful' => 'Двухфакторная аутентификация настроена успешно. Вам нужно будет с этого момента проходить аутентификацию каждый раз, когда вы входите в систему.',
	'active_language' => 'Активный язык',
	'timezone' => 'Часовой пояс',
	'upload_new_avatar' => 'Загрузить новый аватар',
	'nickname_already_exists' => 'Выбранный никнейм уже существует.',
	'change_email_address' => 'Изменить адрес электронной почты',
	'email_already_exists' => 'Введенный вами адрес электронной почты уже существует.',
	'email_changed_successfully' => 'Адрес электронной почты успешно изменен.',
	'avatar' => 'Аватар',
	
	// Оповещения
	'user_tag_info' => 'Вы были отмечены в сообщении {x}.', // Не заменять {x}
	'no_alerts' => 'Нет новых оповещений',
	'view_alerts' => 'Просмотр оповещений',
	'1_new_alert' => 'У вас есть 1 новое оповещений',
	'x_new_alerts' => 'У вас есть {x} новых оповещений', // Не заменять {x}
	'no_alerts_usercp' => 'У вас нет никаких оповещений.',
	
	// Регистрация
	'registration_check_email' => 'Спасибо за регистрацию! Пожалуйста, проверьте свою электронную почту по ссылки для подтверждения, чтобы завершить регистрацию. Если вы не можете найти электронную почту, проверьте папку нежелательной почты.',
	'username' => 'Имя',
	'nickname' => 'Ник',
	'minecraft_username' => 'Ник в Minecraft',
	'email_address' => 'Email адрес',
	'email' => 'Email',
	'password' => 'Пароль',
	'confirm_password' => 'Повторить пароль',
	'i_agree' => 'Согласен',
	'agree_t_and_c' => 'Нажимая <strong class="label label-primary">Регистрация</strong>, вы соглашаетесь с нашими <a href="{x}" target="_blank">Условиями использования</a>.',
	'create_an_account' => 'Создать аккаунт',
	'terms_and_conditions' => 'Условия и положения',
	'validation_complete' => 'Ваша учетная запись подтверждена, теперь вы можете войти.',
	'validation_error' => 'При проверке вашей учетной записи произошла неизвестная ошибка, обратитесь к администратору сайта.',
	'signature' => 'Подпись',
	'signature_max_900' => 'Ваша подпись должна быть не более 900 символов.',

	// Регистрация - Authme
    'connect_with_authme' => 'Подключите свой аккаунт с AuthMe',
	'authme_help' => 'Пожалуйста, введите данные своей учетной записи AuthMe. Если у вас еще нет учетной записи в игре, присоединитесь к серверу сейчас и следуйте предоставленным инструкциям.',
	'unable_to_connect_to_authme_db' => 'Невозможно подключиться к базе данных AuthMe. Если эта ошибка не устранена, обратитесь к администратору.',
	'authme_account_linked' => 'Аккаунт успешно связан.',
	'authme_email_help_1' => 'Наконец, пожалуйста, введите свой адрес электронной почты.',
	'authme_email_help_2' => 'Наконец, введите свой адрес электронной почты, а также выберите отображаемое имя для своей учетной записи.',
	
	// Ошибки регистрации
	'username_required' => 'Требуется имя пользователя.',
	'email_required' => 'Требуется адрес электронной почты.',
	'password_required' => 'Требуется пароль.',
	'mcname_required' => 'Требуется имя пользователя Minecraft.',
	'accept_terms' => 'Вы должны принять условия перед регистрацией.',
	'username_minimum_3' => 'Ваше имя пользователя должно быть не менее 3 символов.',
	'mcname_minimum_3' => 'Ваше имя пользователя Minecraft должно быть не менее 3 символов..',
	'password_minimum_6' => 'Ваш пароль должен содержать не менее 6 символов.',
	'username_maximum_20' => 'Ваше имя пользователя должно содержать не более 20 символов.',
	'mcname_maximum_20' => 'Ваше имя пользователя Minecraft должно содержать не более 20 символов.',
	'password_maximum_30' => 'Ваш пароль должен содержать не более 30 символов.',
	'passwords_dont_match' => 'Ваши пароли не совпадают.',
	'username_mcname_email_exists' => 'Ваше имя пользователя или адрес электронной почты уже существует.',
	'invalid_mcname' => 'Ваше имя пользователя Minecraft неверно.',
	'invalid_email' => 'Ваш электронный адрес недействителен.',
	'mcname_lookup_error' => 'Произошла ошибка связи с серверами Mojang для проверки вашего имени пользователя. Пожалуйста, попробуйте позже.',
	'invalid_recaptcha' => 'Неверный ответ reCAPTCHA.',
	'verify_account' => 'Подтвердить аккаунт',
	'verify_account_help' => 'Пожалуйста, следуйте приведенным ниже инструкциям, чтобы мы могли подтвердить Вашу учетную запись Minecraft.',
	'validate_account' => 'Подтвердить аккаунт',
	'verification_failed' => 'Проверка не удалась. Пожалуйста, попробуйте еще раз.',
	'verification_success' => 'Успешно подтверждено! Теперь вы можете войти.',
	'authme_username_exists' => 'Ваша учетная запись Authme уже подключена к сайту!',
	'uuid_already_exists' => 'Ваш UUID уже существует, то есть эта учетная запись Minecraft уже зарегистрирована.',
	
	// Авторизация
	'successful_login' => 'Вы успешно вошли.',
	'incorrect_details' => 'Вы ввели неверные данные.',
	'inactive_account' => 'Ваш аккаунт неактивен. Пожалуйста, проверьте свою электронную почту для ссылки для проверки, в том числе в вашей папке нежелательной.',
	'account_banned' => 'Этот аккаунт заблокирован.',
	'forgot_password' => 'Забыли пароль?',
	'remember_me' => 'Запомни меня',
	'must_input_email' => 'Вы должны ввести адрес электронной почты.',
	'must_input_username' => 'Вы должны ввести имя пользователя.',
	'must_input_password' => 'Вы должны ввести пароль.',

	// Напоминание пароля
    'forgot_password_instructions' => 'Пожалуйста, введите свой адрес электронной почты, чтобы мы могли отправить вам дальнейшие инструкции по восстановлению вашего пароля.',
	'forgot_password_email_sent' => 'Если учетная запись с адресом электронной почты существует, то письмо было отправлено на него с дальнейшими инструкциями. Если вы не можете его найти, попробуйте проверить папку нежелательной почты.',
	'unable_to_send_forgot_password_email' => 'Невозможно отправить забытый пароль по электронной почте. Пожалуйста, свяжитесь с администратором.',
	'enter_new_password' => 'Пожалуйста, подтвердите свой адрес электронной почты и введите новый пароль ниже.',
	'incorrect_email' => 'Введенный адрес электронной почты не соответствует запросу.',
	'forgot_password_change_successful' => 'Ваш пароль был успешно изменен. Теперь вы можете войти.',
	
	// Страница профиля
	'profile' => 'Профиль',
	'follow' => 'Следить',
	'no_wall_posts' => 'Здесь пока нет постов.',
	'change_banner' => 'Изменить баннер',
	'post_on_wall' => 'Разместить на стене {x}', // Не заменять {x}
	'invalid_wall_post' => 'Пожалуйста, убедитесь, что ваш пост составляет от 1 до 10000 символов.',
	'1_reaction' => '1 реакция',
	'x_reactions' => '{x} реакции', // Не заменять {x}
	'1_like' => '1 лайк',
	'x_likes' => '{x} лайка(ов)', // Не заменять {x}
	'1_reply' => '1 ответ',
	'x_replies' => '{x} ответа(ов)', // Не заменять {x}
	'no_replies_yet' => 'Ответов пока нет',
	'feed' => 'Обратная связь',
	'about' => 'Обо мне',
	'reactions' => 'Реакции',
	'replies' => 'Ответы',
	'new_reply' => 'Новый ответ',
	'registered' => 'Зарегистрирован:',
	'registered_x' => 'Зарегистрирован: {x}',
	'last_seen' => 'Последний вход:',
	'new_wall_post' => '{x} опубликовал в вашем профиле.',
	'couldnt_find_that_user' => 'Не могу найти этого пользователя.',
	'block_user' => 'Заблокировать пользователя',
	'unblock_user' => 'Разблокировать пользователя',
	'confirm_block_user' => 'Вы уверены, что хотите заблокировать этого пользователя? Он не сможет отправлять вам личные сообщения или отмечать вам в сообщениях.',
	'confirm_unblock_user' => 'Вы уверены, что хотите разблокировать этого пользователя? Он сможет отправлять вам личные сообщения и отмечать вам в сообщениях.',
	'user_blocked' => 'Пользователь заблокирован.',
	'user_unblocked' => 'Пользователь разблокирован.',
	'views' => 'Просмотры профиля:',
	'private_profile_page' => 'Это частный профиль!',
	'new_wall_post_reply' => '{x} ответил на ваше сообщение в профиле {y}.', // Не заменять {x} или {y}
	'new_wall_post_reply_your_profile' => '{x} Пользователь ответил на ваше сообщение в вашем профиле.', // Не заменять {x}
	'no_about_fields' => 'тот пользователь еще не добавил ни одного поля.',
	
	// Отчеты
	'invalid_report_content' => 'Невозможно создать отчет. Убедитесь, что причина вашего сообщения составляет от 2 до 1024 символов.',
	'report_post_content' => 'Пожалуйста, введите причину для вашего отчета',
	'report_created' => 'Отчет успешно создан',
	
	// Сообщения
	'no_messages' => 'Нет новых сообщений',
	'no_messages_full' => 'У вас нет сообщений.',
	'view_messages' => 'Просмотр сообщений',
	'1_new_message' => 'У вас есть 1 новое сообщение',
	'x_new_messages' => 'У вас есть {x} новых сообщений', // Не заменять {x}
	'new_message' => 'Новое сообщение',
	'message_title' => 'Заголовок сообщения',
	'to' => 'Для',
	'separate_users_with_commas' => 'Разделяйте пользователей запятыми',
	'title_required' => 'Пожалуйста, введите название',
	'content_required' => 'Пожалуйста, введите некоторый контент',
	'users_to_required' => 'Пожалуйста, введите несколько получателей сообщения',
	'cant_send_to_self' => 'Вы не можете отправить сообщение себе!',
	'title_min_2' => 'Название должно содержать не менее 2 символов',
	'content_min_2' => 'Содержание должно быть не менее 2 символов',
	'title_max_64' => 'Название должно содержать не более 64 символов',
	'content_max_20480' => 'Содержание должно быть не более 20480 символов',
	'max_pm_10_users' => 'Вы можете отправить сообщение максимум 10 пользователям',
	'message_sent_successfully' => 'Сообщение успешно отправлено',
	'participants' => 'Участники',
	'last_message' => 'Последнее сообщение',
	'by' => 'от',
	'leave_conversation' => 'Оставить разговор',
	'confirm_leave' => 'Вы уверены, что хотите оставить этот разговор?',
	'one_or_more_users_blocked' => 'Вы не можете отправлять личные сообщения, по крайней мере, одному участнику разговора.',
	
	/*
	 *  Зона нарушений
	 */
	'you_have_been_banned' => 'Вы забанены!',
	'you_have_received_a_warning' => 'Вы получили предупреждение!',
	'acknowledge' => 'Подтверждение',
	
	/*
	 *  Почтовые сообщения
	 */
	'email_greeting' => 'Привет,',
	'email_message' => 'Спасибо за регистрацию! Для завершения регистрации, пожалуйста, нажмите на следующую ссылку:',
	'forgot_password_email_message' => 'Чтобы сбросить пароль, перейдите по следующей ссылке. Если вы не запрашивали это, вы можете безопасно удалить это письмо.',
	'email_thanks' => 'Спасибо,',

    /*
     *  Хуки
     */
    'user_x_has_registered' => '{x} присоединился к ' . SITE_NAME . '!'
);
